; domain
;; freecell domain.

;
;  check = False
;  while(true)
;       if(!check)
;           obbligato = checkaaaa()
;           check = True
;        else 
;           if(obbligato) to Home
;           else altreMosse
;           check = Falso


(define (domain freecell)
  (:requirements :strips :typing) 
  (:types card
          num
          suit
  )
  
  (:predicates 	(VALUE ?card - card ?val - num)

        (SUIT ?card - card ?st - suit)
        (SUCCESSOR ?n1 - num ?n2 - num)

        ; card relation predicates
        (CANSTACK ?card1 - card ?card2 - card)
        (ON ?card1 - card ?card2 - card)

        ;card status predicates
        (INCELL ?card - card)
        (CLEAR ?card - card)
        (HOME ?card - card)
        (BOTTOMCOL ?card - card)

        (CELLSPACE ?ncol - num)
        (COLSPACE ?ncol - num))
  
(:action FROM-BOTTOM-TO-FREE
  :parameters (?card - card ?ncol - num ?ncol_prev - num ?nfree - num ?nfree_prev - num)
  :precondition
   (and (BOTTOMCOL ?card) (COLSPACE ?ncol_prev) (SUCCESSOR ?ncol ?ncol_prev) (CELLSPACE ?nfree) (SUCCESSOR ?nfree ?nfree_prev) )
  :effect
   (and (not (CLEAR ?card)) (not (BOTTOMCOL ?card)) (not (COLSPACE ?ncol_prev)) (COLSPACE ?ncol) (INCELL ?card) (not (CELLSPACE ?nfree)) (CELLSPACE ?nfree_prev))
)

(:action FROM-STACK-TO-FREE
  :parameters (?card - card ?card_prev - card  ?nfree - num ?nfree_prev - num)
  :precondition
   (and (CLEAR ?card) (ON ?card ?card_prev) (CELLSPACE ?nfree) (SUCCESSOR ?nfree ?nfree_prev) )
  :effect
   (and (not (CLEAR ?card)) (not (ON ?card ?card_prev)) (INCELL ?card) (not (CELLSPACE ?nfree)) (CELLSPACE ?nfree_prev) (CLEAR ?card_prev))
)

(:action FROM-FREE-TO-BOTTOM
  :parameters (?card - card ?ncol - num ?ncol_prev - num ?nfree - num ?nfree_prev - num)
  :precondition
   (and (INCELL ?card) (COLSPACE ?ncol) (SUCCESSOR ?ncol ?ncol_prev) (CELLSPACE ?nfree_prev) (SUCCESSOR ?nfree ?nfree_prev) )
  :effect
   (and  (CLEAR ?card)  (BOTTOMCOL ?card) (not (COLSPACE ?ncol)) (COLSPACE ?ncol_prev) (not (INCELL ?card)) (not (CELLSPACE ?nfree_prev)) (CELLSPACE ?nfree))
)

(:action FROM-FREE-TO-STACK
  :parameters (?card - card ?card_prev - card ?nfree - num ?nfree_prev - num)
  :precondition
   (and (INCELL ?card)  (CELLSPACE ?nfree_prev) (SUCCESSOR ?nfree ?nfree_prev) (CLEAR ?card_prev) (CANSTACK ?card ?card_prev))
  :effect
   (and (not (CLEAR ?card_prev)) (CLEAR ?card) (not (INCELL ?card)) (not (CELLSPACE ?nfree_prev)) (CELLSPACE ?nfree) (ON ?card ?card_prev) )
)

; (:action FROM-STACK-TO-STACK
;   :parameters (?card - card ?card_to - card ?card_prev - card)
;   :precondition
;    (and (CLEAR ?card) (CLEAR ?card_to) (CANSTACK ?card ?card_to) (ON ?card ?card_prev))
;   :effect
;    (and  (CLEAR ?card_prev) (not (CLEAR ?card_to)) (not (ON ?card ?card_prev)) (ON ?card ?card_to))
; )
(:action FROM-STACK-TO-STACK
  :parameters (?card - card ?card_to - card ?card_prev - card ?card_home - card ?suit - suit ?val - num ?val_home - num)
  :precondition
   (and (CLEAR ?card) (CLEAR ?card_to) (CANSTACK ?card ?card_to) 
   (ON ?card ?card_prev)  (VALUE ?card ?val) (VALUE ?card_home ?val_home) (SUIT ?card ?suit) (SUIT ?card_home ?suit) (SUCCESSOR ?val ?val_home)
  (not (and (HOME ?card_home))))
  :effect
   (and  (CLEAR ?card_prev) (not (CLEAR ?card_to)) (not (ON ?card ?card_prev)) (ON ?card ?card_to))
)

(:action FROM-BOTTOM-TO-STACK
  :parameters (?card - card ?card_to - card ?ncol - num ?ncol_prev - num)
  :precondition
   (and  (CLEAR ?card_to) (CANSTACK ?card ?card_to) (BOTTOMCOL ?card) (COLSPACE ?ncol_prev) (SUCCESSOR ?ncol ?ncol_prev))
  :effect
   (and  (not (CLEAR ?card_to)) (not (BOTTOMCOL ?card)) (ON ?card ?card_to) (not (COLSPACE ?ncol_prev)) (COLSPACE ?ncol))
)

(:action FROM-BOTTOM-TO-HOME
  :parameters (?card - card ?card_to - card ?suit - suit ?val - num ?val_to - num ?ncol - num ?ncol_prev - num)
  :precondition
   (and (BOTTOMCOL ?card) (HOME ?card_to) (SUIT ?card ?suit) (SUIT ?card_to ?suit) 
    (VALUE ?card ?val) (VALUE ?card_to ?val_to) (SUCCESSOR ?val ?val_to ) (COLSPACE ?ncol_prev) (SUCCESSOR ?ncol ?ncol_prev))
  :effect
   (and  (not (HOME ?card_to)) (HOME ?card) (not (CLEAR ?card)) (not (BOTTOMCOL ?card)) 
   (not (COLSPACE ?ncol_prev)) (COLSPACE ?ncol))
)

(:action FROM-STACK-TO-HOME
  :parameters (?card - card ?card_to - card ?card_prev - card ?suit - suit ?val - num ?val_to - num)
  :precondition
   (and (CLEAR ?card) (HOME ?card_to) (ON ?card ?card_prev) (SUIT ?card ?suit) (SUIT ?card_to ?suit) 
    (VALUE ?card ?val) (VALUE ?card_to ?val_to) (SUCCESSOR ?val ?val_to ))
  :effect
   (and  (not (HOME ?card_to)) (HOME ?card) (not (CLEAR ?card)) (CLEAR ?card_prev) (not (ON ?card ?card_prev)))
)

(:action FROM-FREE-TO-HOME
  :parameters (?card - card ?card_to - card ?suit - suit ?val - num ?val_to - num ?ncol - num ?ncol_prev - num)
  :precondition
   (and (INCELL ?card) (HOME ?card_to) (SUIT ?card ?suit) (SUIT ?card_to ?suit) 
    (VALUE ?card ?val) (VALUE ?card_to ?val_to) (SUCCESSOR ?val ?val_to ) (CELLSPACE ?ncol_prev) (SUCCESSOR ?ncol ?ncol_prev))
  :effect
   (and  (not (HOME ?card_to)) (HOME ?card) (not (INCELL ?card)) 
   (not (CELLSPACE ?ncol_prev)) (CELLSPACE ?ncol))
)

)

; problem
(define (problem freecell-2-1)
(:domain freecell)
(:objects
    SA
    S2
    S0
    HA
    H2
    H0
    DA
    D2
    D0
    CA
    C2
    C0
 - card
    N8
    N7
    N6
    N5
    N4
    N3
    N13
    N12
    N11
    N9
    N10
    N1
    N2
    N0
 - num
    S
    H
    D
    C
 - suit
)
(:init
    (VALUE C0 N0)
    (VALUE C2 N2)
    (VALUE CA N1)
    (VALUE D0 N0)
    (VALUE D2 N2)
    (VALUE DA N1)
    (VALUE H0 N0)
    (VALUE H2 N2)
    (VALUE HA N1)
    (VALUE S0 N0)
    (VALUE S2 N2)
    (VALUE SA N1)
    (SUCCESSOR N1 N0)
    (SUCCESSOR N10 N9)
    (SUCCESSOR N11 N10)
    (SUCCESSOR N12 N11)
    (SUCCESSOR N13 N12)
    (SUCCESSOR N2 N1)
    (SUCCESSOR N3 N2)
    (SUCCESSOR N4 N3)
    (SUCCESSOR N5 N4)
    (SUCCESSOR N6 N5)
    (SUCCESSOR N7 N6)
    (SUCCESSOR N8 N7)
    (SUCCESSOR N9 N8)
    (SUIT C0 C)
    (SUIT C2 C)
    (SUIT CA C)
    (SUIT D0 D)
    (SUIT D2 D)
    (SUIT DA D)
    (SUIT H0 H)
    (SUIT H2 H)
    (SUIT HA H)
    (SUIT S0 S)
    (SUIT S2 S)
    (SUIT SA S)
    (CANSTACK CA D2)
    (CANSTACK CA H2)
    (CANSTACK DA C2)
    (CANSTACK DA S2)
    (CANSTACK HA C2)
    (CANSTACK HA S2)
    (CANSTACK SA D2)
    (CANSTACK SA H2)
    (HOME C0)
    (HOME D0)
    (HOME H0)
    (HOME S0)
    (CELLSPACE N4)
    (COLSPACE N2)
    (ON C2 CA)
    (ON CA SA)
    (CLEAR C2)
    (CLEAR D2)
    (CLEAR DA)
    (CLEAR H2)
    (CLEAR HA)
    (CLEAR S2)
    (BOTTOMCOL D2)
    (BOTTOMCOL DA)
    (BOTTOMCOL H2)
    (BOTTOMCOL HA)
    (BOTTOMCOL S2)
    (BOTTOMCOL SA)
)
(:goal (and
    (HOME C2)
    (HOME D2)
    (HOME H2)
    (HOME S2)
)))

; plan
1. (from-stack-to-free c2 ca n4 n3)
   deleted: (clear c2) (on c2 ca) (cellspace n4)
   added: (incell c2) (cellspace n3) (clear ca)
   goals met: 0 of 4
2. (from-bottom-to-home sa s0 s n1 n0 n3 n2)
   deleted: (home s0) (bottomcol sa) (colspace n2)
   added: (home sa) (colspace n3)
   goals met: 0 of 4
3. (from-stack-to-home ca c0 sa c n1 n0)
   deleted: (home c0) (clear ca) (on ca sa)
   added: (home ca) (clear sa)
   goals met: 0 of 4
4. (from-bottom-to-home da d0 d n1 n0 n4 n3)
   deleted: (home d0) (clear da) (bottomcol da) (colspace n3)
   added: (home da) (colspace n4)
   goals met: 0 of 4
5. (from-free-to-home c2 ca c n2 n1 n4 n3)
   deleted: (home ca) (incell c2) (cellspace n3)
   added: (home c2) (cellspace n4)
   goals met: 1 of 4
6. (from-bottom-to-home ha h0 h n1 n0 n5 n4)
   deleted: (home h0) (clear ha) (bottomcol ha) (colspace n4)
   added: (home ha) (colspace n5)
   goals met: 1 of 4
7. (from-bottom-to-home d2 da d n2 n1 n6 n5)
   deleted: (home da) (clear d2) (bottomcol d2) (colspace n5)
   added: (home d2) (colspace n6)
   goals met: 2 of 4
8. (from-bottom-to-home h2 ha h n2 n1 n7 n6)
   deleted: (home ha) (clear h2) (bottomcol h2) (colspace n6)
   added: (home h2) (colspace n7)
   goals met: 3 of 4
9. (from-bottom-to-home s2 sa s n2 n1 n8 n7)
   deleted: (home sa) (clear s2) (bottomcol s2) (colspace n7)
   added: (home s2) (colspace n8)
   goals met: 4 of 4
